app/controllers/posts_controller.rb

SELECT * FROM "posts" WHERE ("posts".user_id = 1) ORDER BY created_at
---
  def index
    @posts = @user.posts.paginate(:page => params[:page], :per_page => 10)

SELECT * FROM "posts" WHERE ("posts"."id" = 1) ORDER BY created_at
---
  def show
    @post = Post.find(params[:id])

INSERT INTO "posts" ("title", "body", "user_id", "updated_at", "created_at") VALUES('first', 'It my first ', 1, '2016-02-12 11:15:16', '2016-02-12 11:15:16')
---
  def create
    @post = @user.posts.build(post_params)
    if @post.save

DELETE FROM "posts" WHERE "id" = 3
---
  def destroy
    @post.destroy

UPDATE "posts" SET "title" = 'first 2', "updated_at" = '2016-02-12 12:21:03' WHERE "id" = 1
---
  def update
    if @post.update_attributes(post_params)

SELECT * FROM "posts" WHERE ("posts"."id" = 3) ORDER BY created_at
---
  def set_post
    @post = Post.find(params[:id])